sip_backend/app/controllers/api/v1/drinks_controller.rb

SELECT "drinks".* FROM "drinks"
---
  def index
    render json: Drink.all