sip_backend/app/controllers/api/v1/ingredients_controller.rb

  def index
    render json: Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"