app/controllers/api/v1/drinks_controller.rb

  def index
    render json: Drink.paginate(page: params[:page], per_page: params[:per_page])
---
SELECT  "drinks".* FROM "drinks" LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]

  def show
    render json: Drink.find(params[:id])
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    render json: Drink.create(drink_params)
    if drink.save
---
INSERT INTO "drinks" ("name", "likes", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Margarita"], ["likes", 0], ["user_id", 1], ["created_at", "2018-09-13 17:09:24.052191"], ["updated_at", "2018-09-13 17:09:24.052191"]]
INSERT INTO "drinks" ("name", "likes", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Dirty Martini"], ["likes", 0], ["user_id", 1], ["created_at", "2018-09-14 19:08:23.164294"], ["updated_at", "2018-09-14 19:08:23.164294"]]